# Welcome to numpy tutorial

In [1]:
import numpy as np
import pandas as pd

In [2]:
print("Hello World")

Hello World

In [3]:
myarr=np.array([[10,20,30,40]],np.int64)

In [4]:
myarr

array([[10, 20, 30, 40]])

In [5]:
myarr[0,1]

np.int64(20)

In [6]:
myarr.shape

(1, 4)

In [7]:
myarr.dtype

dtype('int64')

In [8]:
myarr

array([[10, 20, 30, 40]])

In [9]:
myarr[0,1]=45

In [10]:
myarr

array([[10, 45, 30, 40]])

# Array Creation:Conversion from other Python structures

In [11]:
listarray = np.array([[1,2,3],[5,8,5],[0,3,1]])

In [12]:
listarray

array([[1, 2, 3],
       [5, 8, 5],
       [0, 3, 1]])

In [13]:
listarray.dtype

dtype('int64')

In [14]:
listarray.shape

(3, 3)

In [15]:
listarray.size

9

# Intrinsic NumPy array creation functions (e.g. arange, ones, zeros, etc.)

In [16]:
np.array({34,23,23})

array({34, 23}, dtype=object)

In [17]:
zeros=np.zeros((2,5))

In [18]:
zeros

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [19]:
zeros.dtype

dtype('float64')

In [20]:
zeros.shape

(2, 5)

In [21]:
rng=np.arange(5)

In [22]:
rng

array([0, 1, 2, 3, 4])

In [23]:
lspace=np.linspace(1,50,10)

In [24]:
lspace

array([ 1.        ,  6.44444444, 11.88888889, 17.33333333, 22.77777778,
       28.22222222, 33.66666667, 39.11111111, 44.55555556, 50.        ])

In [25]:
emp=np.empty((4,6))

In [26]:
emp

array([[6.23042070e-307, 4.67296746e-307, 1.69121096e-306,
        1.24610994e-306, 1.42413555e-306, 1.78019082e-306],
       [1.37959740e-306, 6.23057349e-307, 1.02360935e-306,
        1.69120416e-306, 1.78022342e-306, 6.23058028e-307],
       [1.06811422e-306, 9.45699680e-308, 1.11258854e-306,
        1.11261502e-306, 1.42410839e-306, 7.56597770e-307],
       [6.23059726e-307, 8.90104239e-307, 1.86918699e-306,
        6.23057349e-307, 1.69119330e-306, 8.34451079e-308]])

In [27]:
emp_like=np.empty_like(lspace)

In [28]:
emp_like

array([ 1.        ,  6.44444444, 11.88888889, 17.33333333, 22.77777778,
       28.22222222, 33.66666667, 39.11111111, 44.55555556, 50.        ])

In [29]:
ide=np.identity(45)

In [30]:
ide

array([[1., 0., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 1., 0., 0.],
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 1.]], shape=(45, 45))

In [31]:
ide.shape

(45, 45)

In [32]:
arr=np.arange(99)

In [33]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98])

In [34]:
arr=arr.reshape(3,33)

In [35]:
arr

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
        32],
       [33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48,
        49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64,
        65],
       [66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81,
        82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97,
        98]])

In [36]:
arr=arr.ravel()

In [37]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98])

In [38]:
arr.shape

(99,)

In [39]:
x = [[1,2,3],[4,5,6],[7,8,9]]

In [40]:
arr1=np.array(x)

In [41]:
arr1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [42]:
arr1.sum(axis=0)

array([12, 15, 18])

In [43]:
arr1.sum(axis=1)

array([ 6, 15, 24])

In [44]:
arr1.T

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [45]:
arr1.flat

In [46]:
for item in arr1.flat:
    print(item)

1
2
3
4
5
6
7
8
9

In [47]:
arr1.ndim

2

In [48]:
arr1.size

9

In [49]:
arr1.nbytes

72

In [50]:
one=np.array([1,3,4,634,2])

In [51]:
one.argmax()

np.int64(3)

In [52]:
one.argmin()

np.int64(0)

In [53]:
one.argsort()

array([0, 4, 1, 2, 3])

In [54]:
arr1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [55]:
arr1.argmin()

np.int64(0)

In [56]:
arr1.argmax()

np.int64(8)

In [57]:
arr1.argmax(axis=0)

array([2, 2, 2])

In [58]:
arr1.argmax(axis=1)

array([2, 2, 2])

In [59]:
arr.argsort(axis=0)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98])

In [60]:
arr1.ravel()

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [61]:
arr1.reshape((9,1))

array([[1],
       [2],
       [3],
       [4],
       [5],
       [6],
       [7],
       [8],
       [9]])

In [62]:
arr1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [63]:
arr2=np.array([[1,2,1],[4,0,6],[8,1,0]])

In [64]:
arr1+arr2

array([[ 2,  4,  4],
       [ 8,  5, 12],
       [15,  9,  9]])

In [65]:
arr1*arr2

array([[ 1,  4,  3],
       [16,  0, 36],
       [56,  8,  0]])

In [66]:
np.sqrt(arr1)

array([[1.        , 1.41421356, 1.73205081],
       [2.        , 2.23606798, 2.44948974],
       [2.64575131, 2.82842712, 3.        ]])

In [67]:
arr1.sum()

np.int64(45)

In [68]:
arr1.max()

np.int64(9)

In [69]:
arr1.min()

np.int64(1)

In [70]:
np.where(arr1>5)

(array([1, 2, 2, 2]), array([2, 0, 1, 2]))

In [71]:
type(np.where(arr1>5))

tuple

In [72]:
np.count_nonzero(arr1)

9

In [73]:
np.nonzero(arr1)

(array([0, 0, 0, 1, 1, 1, 2, 2, 2]), array([0, 1, 2, 0, 1, 2, 0, 1, 2]))

In [74]:
arr1[1,2]=0

In [75]:
np.nonzero(arr1)

(array([0, 0, 0, 1, 1, 2, 2, 2]), array([0, 1, 2, 0, 1, 0, 1, 2]))

In [76]:
import sys

In [77]:
py_ar=[0,4,55,2]

In [78]:
np_ar=np.array(py_ar)

In [79]:
sys.getsizeof(1)*len(py_ar)

112

In [80]:
np_ar.itemsize * np_ar.size

32

In [81]:
np_ar.tolist()

[0, 4, 55, 2]

In [82]:
import pandas as pd

In [83]:
dict1={
    "name":['Ishvi','Aman','Tushar','Yamini'],
    "marks":[90,92,91,89],
    "city":['Delhi','Harayana','Rohini','Najafgarh']
}

In [84]:
df = pd.DataFrame(dict1)

In [85]:
ishvi=pd.read_csv('ishvi.csv.csv')

In [86]:
ishvi

   TrainNo  Speed       City
0    12232     90      Delhi
1    72732     92   Harayana
2    38178     91     Rohini
3    73289     89  Najafgarh

In [87]:
ishvi['Speed']

0    90
1    92
2    91
3    89
Name: Speed, dtype: int64

In [88]:
ishvi['Speed'][0]

np.int64(90)

In [89]:
ishvi['Speed'][0]=50

C:\Users\dell\AppData\Local\Temp\ipykernel_22428\3324807421.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ishvi['Speed'][0]=50

In [90]:
ishvi

   TrainNo  Speed       City
0    12232     50      Delhi
1    72732     92   Harayana
2    38178     91     Rohini
3    73289     89  Najafgarh

In [91]:
ishvi.to_csv('ishvi.csv',index=False)

In [92]:
ishvi.index = ['first','second','third','fourth']

In [93]:
ishvi

        TrainNo  Speed       City
first     12232     50      Delhi
second    72732     92   Harayana
third     38178     91     Rohini
fourth    73289     89  Najafgarh

In [94]:
ser=pd.Series(np.random.rand)

In [95]:
ser=pd.Series(np.random.rand(34))

In [96]:
type(ser)

pandas.core.series.Series

In [97]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [98]:
newdf

            0         1         2         3         4
0    0.653233  0.157450  0.655528  0.118118  0.202044
1    0.050939  0.558863  0.430774  0.459138  0.998153
2    0.942839  0.862690  0.595492  0.491221  0.396037
3    0.934001  0.372846  0.223908  0.331091  0.765693
4    0.120901  0.531177  0.839910  0.177574  0.456581
..        ...       ...       ...       ...       ...
329  0.364040  0.546887  0.703670  0.394201  0.072596
330  0.658810  0.967434  0.970565  0.593643  0.147058
331  0.503637  0.530138  0.245880  0.835877  0.812134
332  0.448307  0.772018  0.834457  0.870341  0.027131
333  0.815868  0.630754  0.776159  0.749610  0.321107

[334 rows x 5 columns]

In [99]:
newdf.head()

          0         1         2         3         4
0  0.653233  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153
2  0.942839  0.862690  0.595492  0.491221  0.396037
3  0.934001  0.372846  0.223908  0.331091  0.765693
4  0.120901  0.531177  0.839910  0.177574  0.456581

In [100]:
type(newdf)

pandas.core.frame.DataFrame

In [101]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.476108    0.488701    0.469357    0.505637    0.494717
std      0.290888    0.287783    0.275165    0.299802    0.307552
min      0.011281    0.002372    0.001270    0.002581    0.007905
25%      0.220768    0.238988    0.246600    0.220554    0.214153
50%      0.449959    0.470176    0.455978    0.523749    0.500223
75%      0.728638    0.734623    0.688564    0.749549    0.765509
max      0.999415    0.999463    0.987607    0.997305    0.998153

In [102]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [103]:
newdf.head()

          0         1         2         3         4
0  0.653233  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153
2  0.942839  0.862690  0.595492  0.491221  0.396037
3  0.934001  0.372846  0.223908  0.331091  0.765693
4  0.120901  0.531177  0.839910  0.177574  0.456581

In [104]:
newdf[0][0]="ishvi"

C:\Users\dell\AppData\Local\Temp\ipykernel_22428\138492369.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="ishvi"
C:\Users\dell\AppData\Local\Temp\ipykernel_22428\138492369.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'ishvi' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="ishvi"

In [105]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [106]:
newdf.head()

          0         1         2         3         4
0     ishvi  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153
2  0.942839  0.862690  0.595492  0.491221  0.396037
3  0.934001  0.372846  0.223908  0.331091  0.765693
4  0.120901  0.531177  0.839910  0.177574  0.456581

In [107]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [108]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [109]:
newdf.to_numpy()

array([['ishvi', 0.15745012884631815, 0.655528168833698,
        0.11811762283201965, 0.20204355555678055],
       [0.0509386681666093, 0.5588628709579924, 0.43077361647054613,
        0.45913843988223746, 0.9981525931178811],
       [0.9428388460723043, 0.8626902643688822, 0.5954917240207761,
        0.49122129836532313, 0.3960365435695061],
       ...,
       [0.5036368926070742, 0.5301383402569138, 0.24587966936890326,
        0.8358772031397949, 0.8121339729000852],
       [0.44830736324148857, 0.7720182093971913, 0.8344573286165623,
        0.8703408479877034, 0.027130867450672724],
       [0.8158680808301775, 0.6307541146598983, 0.7761594389707478,
        0.7496095751413827, 0.32110740598612453]],
      shape=(334, 5), dtype=object)

In [110]:
newdf[0][0]=0.3

In [111]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.050939,0.942839,0.934001,0.120901,0.343092,0.768508,0.289132,0.184082,0.293996,...,0.040704,0.609137,0.210543,0.068177,0.961684,0.36404,0.65881,0.503637,0.448307,0.815868
1,0.15745,0.558863,0.86269,0.372846,0.531177,0.483345,0.014563,0.960992,0.650667,0.43021,...,0.58649,0.935154,0.70519,0.06317,0.376847,0.546887,0.967434,0.530138,0.772018,0.630754
2,0.655528,0.430774,0.595492,0.223908,0.83991,0.335636,0.0281,0.632041,0.215937,0.619,...,0.019007,0.92425,0.604958,0.063311,0.128137,0.70367,0.970565,0.24588,0.834457,0.776159
3,0.118118,0.459138,0.491221,0.331091,0.177574,0.938445,0.177134,0.680106,0.364781,0.048932,...,0.116188,0.524717,0.412952,0.996703,0.9149,0.394201,0.593643,0.835877,0.870341,0.74961
4,0.202044,0.998153,0.396037,0.765693,0.456581,0.25206,0.69753,0.947635,0.837905,0.919314,...,0.910105,0.864175,0.660756,0.176823,0.468709,0.072596,0.147058,0.812134,0.027131,0.321107

In [112]:
newdf.head()

          0         1         2         3         4
0       0.3  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153
2  0.942839  0.862690  0.595492  0.491221  0.396037
3  0.934001  0.372846  0.223908  0.331091  0.765693
4  0.120901  0.531177  0.839910  0.177574  0.456581

In [113]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.815868  0.630754  0.776159  0.749610  0.321107
332  0.448307  0.772018  0.834457  0.870341  0.027131
331  0.503637  0.530138  0.245880  0.835877  0.812134
330   0.65881  0.967434  0.970565  0.593643  0.147058
329   0.36404  0.546887  0.703670  0.394201  0.072596
..        ...       ...       ...       ...       ...
4    0.120901  0.531177  0.839910  0.177574  0.456581
3    0.934001  0.372846  0.223908  0.331091  0.765693
2    0.942839  0.862690  0.595492  0.491221  0.396037
1    0.050939  0.558863  0.430774  0.459138  0.998153
0         0.3  0.157450  0.655528  0.118118  0.202044

[334 rows x 5 columns]

In [114]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.202044  0.118118  0.655528  0.157450       0.3
1    0.998153  0.459138  0.430774  0.558863  0.050939
2    0.396037  0.491221  0.595492  0.862690  0.942839
3    0.765693  0.331091  0.223908  0.372846  0.934001
4    0.456581  0.177574  0.839910  0.531177  0.120901
..        ...       ...       ...       ...       ...
329  0.072596  0.394201  0.703670  0.546887   0.36404
330  0.147058  0.593643  0.970565  0.967434   0.65881
331  0.812134  0.835877  0.245880  0.530138  0.503637
332  0.027131  0.870341  0.834457  0.772018  0.448307
333  0.321107  0.749610  0.776159  0.630754  0.815868

[334 rows x 5 columns]

In [115]:
newdf.head()

          0         1         2         3         4
0       0.3  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153
2  0.942839  0.862690  0.595492  0.491221  0.396037
3  0.934001  0.372846  0.223908  0.331091  0.765693
4  0.120901  0.531177  0.839910  0.177574  0.456581

In [116]:
newdf[0]

0           0.3
1      0.050939
2      0.942839
3      0.934001
4      0.120901
         ...
329     0.36404
330     0.65881
331    0.503637
332    0.448307
333    0.815868
Name: 0, Length: 334, dtype: object

In [117]:
type(newdf[0])

pandas.core.series.Series

In [118]:
newdf2=newdf

In [119]:
newdf2[0][0]=9783

In [120]:
newdf

            0         1         2         3         4
0        9783  0.157450  0.655528  0.118118  0.202044
1    0.050939  0.558863  0.430774  0.459138  0.998153
2    0.942839  0.862690  0.595492  0.491221  0.396037
3    0.934001  0.372846  0.223908  0.331091  0.765693
4    0.120901  0.531177  0.839910  0.177574  0.456581
..        ...       ...       ...       ...       ...
329   0.36404  0.546887  0.703670  0.394201  0.072596
330   0.65881  0.967434  0.970565  0.593643  0.147058
331  0.503637  0.530138  0.245880  0.835877  0.812134
332  0.448307  0.772018  0.834457  0.870341  0.027131
333  0.815868  0.630754  0.776159  0.749610  0.321107

[334 rows x 5 columns]

In [121]:
newdf2=newdf.copy()

In [122]:
newdf2[0][0]=97835

C:\Users\dell\AppData\Local\Temp\ipykernel_22428\3030230984.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=97835
C:\Users\dell\AppData\Local\Temp\ipykernel_22428\3030230984.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=97835

In [123]:
newdf

            0         1         2         3         4
0        9783  0.157450  0.655528  0.118118  0.202044
1    0.050939  0.558863  0.430774  0.459138  0.998153
2    0.942839  0.862690  0.595492  0.491221  0.396037
3    0.934001  0.372846  0.223908  0.331091  0.765693
4    0.120901  0.531177  0.839910  0.177574  0.456581
..        ...       ...       ...       ...       ...
329   0.36404  0.546887  0.703670  0.394201  0.072596
330   0.65881  0.967434  0.970565  0.593643  0.147058
331  0.503637  0.530138  0.245880  0.835877  0.812134
332  0.448307  0.772018  0.834457  0.870341  0.027131
333  0.815868  0.630754  0.776159  0.749610  0.321107

[334 rows x 5 columns]

In [124]:
newdf.loc[0,0]=654

In [125]:
newdf.head(2)

          0         1         2         3         4
0       654  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153

In [126]:
newdf.columns=list("ABCDE")

In [127]:
newdf

            A         B         C         D         E
0         654  0.157450  0.655528  0.118118  0.202044
1    0.050939  0.558863  0.430774  0.459138  0.998153
2    0.942839  0.862690  0.595492  0.491221  0.396037
3    0.934001  0.372846  0.223908  0.331091  0.765693
4    0.120901  0.531177  0.839910  0.177574  0.456581
..        ...       ...       ...       ...       ...
329   0.36404  0.546887  0.703670  0.394201  0.072596
330   0.65881  0.967434  0.970565  0.593643  0.147058
331  0.503637  0.530138  0.245880  0.835877  0.812134
332  0.448307  0.772018  0.834457  0.870341  0.027131
333  0.815868  0.630754  0.776159  0.749610  0.321107

[334 rows x 5 columns]

In [128]:
newdf.head(2)

          A         B         C         D         E
0       654  0.157450  0.655528  0.118118  0.202044
1  0.050939  0.558863  0.430774  0.459138  0.998153

In [129]:
newdf.loc[0,0]=654

In [130]:
newdf

            A         B         C         D         E      0
0         654  0.157450  0.655528  0.118118  0.202044  654.0
1    0.050939  0.558863  0.430774  0.459138  0.998153    NaN
2    0.942839  0.862690  0.595492  0.491221  0.396037    NaN
3    0.934001  0.372846  0.223908  0.331091  0.765693    NaN
4    0.120901  0.531177  0.839910  0.177574  0.456581    NaN
..        ...       ...       ...       ...       ...    ...
329   0.36404  0.546887  0.703670  0.394201  0.072596    NaN
330   0.65881  0.967434  0.970565  0.593643  0.147058    NaN
331  0.503637  0.530138  0.245880  0.835877  0.812134    NaN
332  0.448307  0.772018  0.834457  0.870341  0.027131    NaN
333  0.815868  0.630754  0.776159  0.749610  0.321107    NaN

[334 rows x 6 columns]

In [131]:
newdf[0,'A']=65445

In [132]:
newdf

            A         B         C         D         E      0  (0, A)
0         654  0.157450  0.655528  0.118118  0.202044  654.0   65445
1    0.050939  0.558863  0.430774  0.459138  0.998153    NaN   65445
2    0.942839  0.862690  0.595492  0.491221  0.396037    NaN   65445
3    0.934001  0.372846  0.223908  0.331091  0.765693    NaN   65445
4    0.120901  0.531177  0.839910  0.177574  0.456581    NaN   65445
..        ...       ...       ...       ...       ...    ...     ...
329   0.36404  0.546887  0.703670  0.394201  0.072596    NaN   65445
330   0.65881  0.967434  0.970565  0.593643  0.147058    NaN   65445
331  0.503637  0.530138  0.245880  0.835877  0.812134    NaN   65445
332  0.448307  0.772018  0.834457  0.870341  0.027131    NaN   65445
333  0.815868  0.630754  0.776159  0.749610  0.321107    NaN   65445

[334 rows x 7 columns]

In [133]:
newdf=newdf.drop(0, axis=1)

In [134]:
newdf.head()

          A         B         C         D         E  (0, A)
0       654  0.157450  0.655528  0.118118  0.202044   65445
1  0.050939  0.558863  0.430774  0.459138  0.998153   65445
2  0.942839  0.862690  0.595492  0.491221  0.396037   65445
3  0.934001  0.372846  0.223908  0.331091  0.765693   65445
4  0.120901  0.531177  0.839910  0.177574  0.456581   65445

In [135]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.430774  0.459138
2  0.595492  0.491221

In [136]:
newdf.loc[:,['C','D']]

            C         D
0    0.655528  0.118118
1    0.430774  0.459138
2    0.595492  0.491221
3    0.223908  0.331091
4    0.839910  0.177574
..        ...       ...
329  0.703670  0.394201
330  0.970565  0.593643
331  0.245880  0.835877
332  0.834457  0.870341
333  0.776159  0.749610

[334 rows x 2 columns]

In [137]:
newdf.loc[[1,2],:]

          A         B         C         D         E  (0, A)
1  0.050939  0.558863  0.430774  0.459138  0.998153   65445
2  0.942839  0.862690  0.595492  0.491221  0.396037   65445

In [138]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E  (0, A)
1    0.050939  0.558863  0.430774  0.459138  0.998153   65445
4    0.120901  0.531177  0.839910  0.177574  0.456581   65445
7    0.289132  0.960992  0.632041  0.680106  0.947635   65445
8    0.184082  0.650667  0.215937  0.364781  0.837905   65445
9    0.293996  0.430210  0.619000  0.048932  0.919314   65445
..        ...       ...       ...       ...       ...     ...
315  0.144241  0.143910  0.279372  0.274690  0.754736   65445
316  0.200494  0.400461  0.805114  0.916718  0.055082   65445
324  0.040704  0.586490  0.019007  0.116188  0.910105   65445
326  0.210543  0.705190  0.604958  0.412952  0.660756   65445
327  0.068177  0.063170  0.063311  0.996703  0.176823   65445

[112 rows x 6 columns]

In [139]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E  (0, A)
1    0.050939  0.558863  0.430774  0.459138  0.998153   65445
4    0.120901  0.531177  0.839910  0.177574  0.456581   65445
7    0.289132  0.960992  0.632041  0.680106  0.947635   65445
8    0.184082  0.650667  0.215937  0.364781  0.837905   65445
9    0.293996  0.430210  0.619000  0.048932  0.919314   65445
..        ...       ...       ...       ...       ...     ...
307  0.028103  0.587089  0.953788  0.926097  0.434347   65445
311  0.272623  0.920480  0.455474  0.830442  0.140928   65445
315  0.144241  0.143910  0.279372  0.274690  0.754736   65445
316  0.200494  0.400461  0.805114  0.916718  0.055082   65445
326  0.210543  0.705190  0.604958  0.412952  0.660756   65445

[98 rows x 6 columns]

In [140]:
newdf.head(2)

          A         B         C         D         E  (0, A)
0       654  0.157450  0.655528  0.118118  0.202044   65445
1  0.050939  0.558863  0.430774  0.459138  0.998153   65445

In [141]:
newdf.iloc[0,4]

np.float64(0.20204355555678055)

In [142]:
newdf.iloc[[0,1],[1,2]]

          B         C
0  0.157450  0.655528
1  0.558863  0.430774

In [143]:
newdf.head(3)

          A         B         C         D         E  (0, A)
0       654  0.157450  0.655528  0.118118  0.202044   65445
1  0.050939  0.558863  0.430774  0.459138  0.998153   65445
2  0.942839  0.862690  0.595492  0.491221  0.396037   65445

In [144]:
newdf.drop([0])

            A         B         C         D         E  (0, A)
1    0.050939  0.558863  0.430774  0.459138  0.998153   65445
2    0.942839  0.862690  0.595492  0.491221  0.396037   65445
3    0.934001  0.372846  0.223908  0.331091  0.765693   65445
4    0.120901  0.531177  0.839910  0.177574  0.456581   65445
5    0.343092  0.483345  0.335636  0.938445  0.252060   65445
..        ...       ...       ...       ...       ...     ...
329   0.36404  0.546887  0.703670  0.394201  0.072596   65445
330   0.65881  0.967434  0.970565  0.593643  0.147058   65445
331  0.503637  0.530138  0.245880  0.835877  0.812134   65445
332  0.448307  0.772018  0.834457  0.870341  0.027131   65445
333  0.815868  0.630754  0.776159  0.749610  0.321107   65445

[333 rows x 6 columns]

In [145]:
newdf.drop(['A'],axis=1)

            B         C         D         E  (0, A)
0    0.157450  0.655528  0.118118  0.202044   65445
1    0.558863  0.430774  0.459138  0.998153   65445
2    0.862690  0.595492  0.491221  0.396037   65445
3    0.372846  0.223908  0.331091  0.765693   65445
4    0.531177  0.839910  0.177574  0.456581   65445
..        ...       ...       ...       ...     ...
329  0.546887  0.703670  0.394201  0.072596   65445
330  0.967434  0.970565  0.593643  0.147058   65445
331  0.530138  0.245880  0.835877  0.812134   65445
332  0.772018  0.834457  0.870341  0.027131   65445
333  0.630754  0.776159  0.749610  0.321107   65445

[334 rows x 5 columns]

In [146]:
newdf.drop(['A','C'],axis=1)

            B         D         E  (0, A)
0    0.157450  0.118118  0.202044   65445
1    0.558863  0.459138  0.998153   65445
2    0.862690  0.491221  0.396037   65445
3    0.372846  0.331091  0.765693   65445
4    0.531177  0.177574  0.456581   65445
..        ...       ...       ...     ...
329  0.546887  0.394201  0.072596   65445
330  0.967434  0.593643  0.147058   65445
331  0.530138  0.835877  0.812134   65445
332  0.772018  0.870341  0.027131   65445
333  0.630754  0.749610  0.321107   65445

[334 rows x 4 columns]

In [147]:
newdf.drop(['A','D'],axis=1,inplace=True)

In [148]:
newdf

            B         C         E  (0, A)
0    0.157450  0.655528  0.202044   65445
1    0.558863  0.430774  0.998153   65445
2    0.862690  0.595492  0.396037   65445
3    0.372846  0.223908  0.765693   65445
4    0.531177  0.839910  0.456581   65445
..        ...       ...       ...     ...
329  0.546887  0.703670  0.072596   65445
330  0.967434  0.970565  0.147058   65445
331  0.530138  0.245880  0.812134   65445
332  0.772018  0.834457  0.027131   65445
333  0.630754  0.776159  0.321107   65445

[334 rows x 4 columns]

In [149]:
newdf.head()

          B         C         E  (0, A)
0  0.157450  0.655528  0.202044   65445
1  0.558863  0.430774  0.998153   65445
2  0.862690  0.595492  0.396037   65445
3  0.372846  0.223908  0.765693   65445
4  0.531177  0.839910  0.456581   65445

In [150]:
newdf.reset_index()

     index         B         C         E  (0, A)
0        0  0.157450  0.655528  0.202044   65445
1        1  0.558863  0.430774  0.998153   65445
2        2  0.862690  0.595492  0.396037   65445
3        3  0.372846  0.223908  0.765693   65445
4        4  0.531177  0.839910  0.456581   65445
..     ...       ...       ...       ...     ...
329    329  0.546887  0.703670  0.072596   65445
330    330  0.967434  0.970565  0.147058   65445
331    331  0.530138  0.245880  0.812134   65445
332    332  0.772018  0.834457  0.027131   65445
333    333  0.630754  0.776159  0.321107   65445

[334 rows x 5 columns]

In [151]:
newdf.reset_index(drop=True,inplace=True)

In [152]:
newdf.head(3)

          B         C         E  (0, A)
0  0.157450  0.655528  0.202044   65445
1  0.558863  0.430774  0.998153   65445
2  0.862690  0.595492  0.396037   65445

In [153]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: B, Length: 334, dtype: bool

In [154]:
newdf.loc['B']=None

In [155]:
newdf

            B         C         E   (0, A)
0    0.157450  0.655528  0.202044  65445.0
1    0.558863  0.430774  0.998153  65445.0
2    0.862690  0.595492  0.396037  65445.0
3    0.372846  0.223908  0.765693  65445.0
4    0.531177  0.839910  0.456581  65445.0
..        ...       ...       ...      ...
330  0.967434  0.970565  0.147058  65445.0
331  0.530138  0.245880  0.812134  65445.0
332  0.772018  0.834457  0.027131  65445.0
333  0.630754  0.776159  0.321107  65445.0
B         NaN       NaN       NaN      NaN

[335 rows x 4 columns]

In [156]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
330    False
331    False
332    False
333    False
B       True
Name: B, Length: 335, dtype: bool

In [157]:
df=pd.DataFrame({"name": ['Alfred','Batman','Alfred'],
                 "toy": [np.nan,'BatMobile','BullWhip'],
                 "born":[pd.NaT,pd.Timestamp('1940-04-25'),pd.NaT]})

In [158]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  BatMobile 1940-04-25
2  Alfred   BullWhip        NaT

In [159]:
df.dropna()

     name        toy       born
1  Batman  BatMobile 1940-04-25

In [160]:
df.dropna(how='all')

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  BatMobile 1940-04-25
2  Alfred   BullWhip        NaT

In [161]:
df.dropna(how='all',axis=1)

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  BatMobile 1940-04-25
2  Alfred   BullWhip        NaT

In [162]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  BatMobile 1940-04-25
2  Alfred   BullWhip        NaT

In [163]:
df.drop_duplicates()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  BatMobile 1940-04-25
2  Alfred   BullWhip        NaT

In [164]:
df.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  BatMobile 1940-04-25

In [165]:
df.drop_duplicates(subset=['name'],keep='last')

     name        toy       born
1  Batman  BatMobile 1940-04-25
2  Alfred   BullWhip        NaT

In [166]:
df.drop_duplicates(subset=['name'],keep=False)

     name        toy       born
1  Batman  BatMobile 1940-04-25

In [167]:
df.shape

(3, 3)

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [169]:
df['name'].value_counts(dropna=False)

name
Alfred    2
Batman    1
Name: count, dtype: int64

In [170]:
df['toy'].value_counts(dropna=True)

toy
BatMobile    1
BullWhip     1
Name: count, dtype: int64

In [171]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [172]:
df.describe()

                      born
count                    1
mean   1940-04-25 00:00:00
min    1940-04-25 00:00:00
25%    1940-04-25 00:00:00
50%    1940-04-25 00:00:00
75%    1940-04-25 00:00:00
max    1940-04-25 00:00:00

In [173]:
df.count()

name    3
toy     2
born    1
dtype: int64